artillery_without_console_log.txt
Started phase 0, duration: 1s @ 22:22:19(-0300) 2021-08-29
Report @ 22:22:29(-0300) 2021-08-29
Elapsed time: 10 seconds
  Scenarios launched:  20
  Scenarios completed: 0
  Requests completed:  272
  Mean response/sec: 28.3
  Response time (msec):
    min: 3
    max: 861
    median: 341
    p95: 377.9
    p99: 719.5
  Codes:
    200: 272

Report @ 22:22:39(-0300) 2021-08-29
Elapsed time: 20 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  289
  Mean response/sec: 28.93
  Response time (msec):
    min: 330
    max: 414
    median: 344
    p95: 375.1
    p99: 408
  Codes:
    200: 289

Report @ 22:22:49(-0300) 2021-08-29
Elapsed time: 30 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  292
  Mean response/sec: 29.26
  Response time (msec):
    min: 329
    max: 390
    median: 341
    p95: 370
    p99: 382.9
  Codes:
    200: 292

Report @ 22:22:55(-0300) 2021-08-29
Elapsed time: 36 seconds
  Scenarios launched:  0
  Scenarios completed: 20
  Requests completed:  147
  Mean response/sec: 23.88
  Response time (msec):
    min: 288
    max: 419
    median: 342
    p95: 383.2
    p99: 401.5
  Codes:
    200: 147

All virtual users finished
Summary report @ 22:22:55(-0300) 2021-08-29
  Scenarios launched:  20
  Scenarios completed: 20
  Requests completed:  1000
  Mean response/sec: 27.96
  Response time (msec):
    min: 3
    max: 861
    median: 342
    p95: 376
    p99: 409.5
  Scenario counts:
    0: 20 (100%)
  Codes:
    200: 1000